performance-tests/RECORD_05-23-21_12.56.59_PM-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: RECORD 05-23-21 12.56.59 PM-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: RECORD 05-23-21 12.56.59 PM-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  RECORD 05-23-21 12.56.59 PM-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1848,944)
      - go(https://chrome.google.com/webstore/detail/blazemeter-the-continuous/mbopgmdnpcbohhpnfglgohlbhfongabi/related)
      - go(http://localhost:3000/)
      - clickByCSS(input[type="text"])
      - typeByCSS(input[type="text"]): "tester01"
      - clickByCSS(input[type="password"])
      - typeByCSS(input[type="password"]): "GteteqbQQgSr88SwNExUQv2ydb7xuf8c"
      - clickByCSS(button.btn.blue)
      - clickByCSS(button.btn)
      - typeByCSS(input[type="text"]): "tester01"
      - typeByCSS(input[type="password"]): "GteteqbQQgSr88SwNExUQv2ydb7xuf8c"

  RECORD 05-23-21 12.56.59 PM-Http:
    headers:
      sec-ch-ua: '" Not A;Brand";v="99", "Chromium";v="90"'
      sec-ch-ua-mobile: '?0'
      User-Agent: 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/90.0.4430.212 Safari/537.36'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:3000/'
            method: GET
            label: 'http://localhost:3000/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
          - url: 'http://localhost:3000/api/login'
            method: POST
            label: 'http://localhost:3000/api/login'
            headers:
              Accept: application/json
              Content-Type: application/json;charset=UTF-8
            body: '{"username":"tester01","password":"GteteqbQQgSr88SwNExUQv2ydb7xuf8c"}'
          - url: 'http://localhost:3000/api/rooms'
            method: GET
            label: 'http://localhost:3000/api/rooms'
            headers:
              Accept: application/json
              X-User-Auth: '{"username":"tester01","token":"ad4d70a063472fa12b2b44f84aa3dadd"}'
              Content-Type: application/json;charset=UTF-8
          - url: 'http://localhost:3000/api/clients'
            method: GET
            label: 'http://localhost:3000/api/clients'
            headers:
              Accept: application/json
              X-User-Auth: '{"username":"tester01","token":"ad4d70a063472fa12b2b44f84aa3dadd"}'
              Content-Type: application/json;charset=UTF-8
          - url: 'http://localhost:3000/api/bills'
            method: GET
            label: 'http://localhost:3000/api/bills'
            headers:
              Accept: application/json
              X-User-Auth: '{"username":"tester01","token":"ad4d70a063472fa12b2b44f84aa3dadd"}'
              Content-Type: application/json;charset=UTF-8
          - url: 'http://localhost:3000/api/reservations'
            method: GET
            label: 'http://localhost:3000/api/reservations'
            headers:
              Accept: application/json
              X-User-Auth: '{"username":"tester01","token":"ad4d70a063472fa12b2b44f84aa3dadd"}'
              Content-Type: application/json;charset=UTF-8
          - url: 'http://localhost:3000/api/logout'
            method: POST
            label: 'http://localhost:3000/api/logout'
            headers:
              Accept: application/json
              Content-Type: application/json;charset=UTF-8
            body: '{"username":"tester01","token":"ad4d70a063472fa12b2b44f84aa3dadd"}'